# vsoWSGetParamForEdit

## Description
Get the parameter that a worksheet is trying to edit.

```pascal
PROCEDURE vsoWSGetParamForEdit(VAR paramName : STRING);
```

```python
def vs.vsoWSGetParamForEdit():
    return paramName
```

## Parameters
|Name|Type|Description|
|---|---|---|
|paramName|STRING|   |

## Version
Availability: from Vectorworks 2017

## Category
* Object Events